v2112/run/DPMFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          1024;
        startFace       95232;
    }
    outlet
    {
        type            patch;
        nFaces          1024;
        startFace       96256;
    }
    upperAtm
    {
        type            patch;
        nFaces          1024;
        startFace       97280;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1024;
        startFace       98304;
    }
    frontAtm
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1024;
        startFace       99328;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  backAtm;
    }
    backAtm
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1024;
        startFace       100352;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  frontAtm;
    }
)

// ************************************************************************* //
