v2112/run/DPMFoam/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kinematicCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       true;
    cellValueSourceCorrection off;

    interpolationSchemes
    {
        rho.air         cell;
        U.air           cellPoint;
        mu.air          cell;
    }

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U semiImplicit 1;
        }
    }
}

constantProperties
{
    parcelTypeId    1;
    rhoMin          1e-15;
    minParcelMass   1e-15;
    rho0            2700;   // Ice particles (2526;)
    youngsModulus   1e8;    // Constant of proportionality relating the deformation 
                            //   to the applied stress for your particles (N/m2)
    poissonsRatio   0.35;   // Ratio of traverse to axial strain for your particles (dimensionless)
    constantVolume  true;   //   false;
    alphaMax        0.99;
}

subModels
{
    particleForces
    {
        ErgunWenYuDrag
        {
            alphac  alpha.air;
        }
    }

    injectionModels
    {
        model1
        {
            type            patchFlowRateInjection;
            patch           inlet;
            SOI             0;
            duration        20;

            parcelBasisType     fixed;          // options of representing particles.(fixed, number, mass)
            massTotal           1;              // total mass to be injected (kg)
            nParticle           1;              // number of particlesper parcel to be injected
            parcelsPerSecond    10;             // for PatchInjectionType
            concentration       1.0;            // concentration of parcel injection over SOI
            parcelConcentration 1000; // <<-- THIS IS WHAT MATTERS!
            phi                 phi.air;
            U0                  (17.55 0 0);
            flowRateProfile     constant 1;
            sizeDistribution
            {
                type            fixedValue;
                fixedValueDistribution
                {
                    value       0.0020;
                }
            }
        }
    }

    dispersionModel none;

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            inlet {type escape;}
            outlet {type escape;}
            upperAtm {type escape;}
            ground
            {
                type rebound;
                e    0.97;
                mu   0.09;
            }
            frontAtm {type escape;}
            backAtm {type escape;}
        );
    }
    
    StandardWallInteractionCoeffs
    {
        type rebound;
        e    0.97;
        mu   0.09;
    }

    heatTransferModel none;

    surfaceFilmModel none;

    collisionModel none;//pairCollision;

    pairCollisionCoeffs
    {
        maxInteractionDistance  0.0025;

        writeReferredParticleCloud no;

        pairModel pairSpringSliderDashpot;

        pairSpringSliderDashpotCoeffs
        {
            useEquivalentSize   no;
            alpha               0.02;
            b                   1.5;
            mu                  0.10;
            cohesionEnergyDensity 0;
            collisionResolutionSteps 12;
        };

        wallModel wallSpringSliderDashpot;

        wallSpringSliderDashpotCoeffs
        {
            useEquivalentSize no;
            collisionResolutionSteps 12;
            youngsModulus   1e8;
            poissonsRatio   0.23;
            alpha           0.01;
            b               1.5;
            mu              0.09;
            cohesionEnergyDensity 0;
        };

        U     U.air;
    }

    stochasticCollisionModel none;

    radiation off;
}


cloudFunctions
{}


// ************************************************************************* //
